RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_can.h
/**
 **************************************************************************
 * File Name    : at32f4xx_can.h
 * Description  : at32f4xx CAN header file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_CAN_H
#define __AT32F4xx_CAN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup CAN
  * @{
  */

/** @defgroup CAN_Exported_Types
  * @{
  */

#if defined (AT32F403xx) || defined (AT32F415xx)
#define IS_CAN_ALL_PERIPH(PERIPH)           ((PERIPH) == CAN1)
#elif defined (AT32F413xx) || defined (AT32F403Axx) || \
      defined (AT32F407xx)
#if !defined (AT32FEBKCx_MD)
#define IS_CAN_ALL_PERIPH(PERIPH)           (((PERIPH) == CAN1) || ((PERIPH) == CAN2))
#else
#define IS_CAN_ALL_PERIPH(PERIPH)           (((PERIPH) == CAN1))
#endif
#endif

/**
  * @brief  CAN init structure definition
  */

typedef struct
{
    uint16_t CAN_Prescaler;                 /*!< Specifies the length of a time quantum.
                                               It ranges from 1 to 1024. */

    uint8_t CAN_Mode;                       /*!< Specifies the CAN operating mode.
                                               This parameter can be a value of
                                              @ref CAN_operating_mode */

    uint8_t CAN_SJW;                        /*!< Specifies the maximum number of time quanta
                                               the CAN hardware is allowed to lengthen or
                                               shorten a bit to perform resynchronization.
                                               This parameter can be a value of
                                               @ref CAN_synchronisation_jump_width */

    uint8_t CAN_BS1;                        /*!< Specifies the number of time quanta in Bit
                                               Segment 1. This parameter can be a value of
                                               @ref CAN_time_quantum_in_bit_segment_1 */

    uint8_t CAN_BS2;                        /*!< Specifies the number of time quanta in Bit
                                               Segment 2.
                                               This parameter can be a value of
                                               @ref CAN_time_quantum_in_bit_segment_2 */

    FunctionalState CAN_TTC;                /*!< Enable or disable the time triggered
                                               communication mode. This parameter can be set
                                               either to ENABLE or DISABLE. */

    FunctionalState CAN_ABO;                /*!< Enable or disable the automatic bus-off
                                                management. This parameter can be set either
                                                to ENABLE or DISABLE. */

    FunctionalState CAN_AWU;                /*!< Enable or disable the automatic wake-up mode.
                                                This parameter can be set either to ENABLE or
                                                DISABLE. */

    FunctionalState CAN_NART;                /*!< Enable or disable the no-automatic
                                                retransmission mode. This parameter can be
                                                set either to ENABLE or DISABLE. */

    FunctionalState CAN_RFL;                /*!< Enable or disable the Receive FIFO Locked mode.
                                                This parameter can be set either to ENABLE
                                                or DISABLE. */

    FunctionalState CAN_TFP;                /*!< Enable or disable the transmit FIFO priority.
                                                This parameter can be set either to ENABLE
                                                or DISABLE. */
} CAN_InitType;

/**
  * @brief  CAN filter init structure definition
  */

typedef struct
{
    uint16_t CAN_FilterIdHigh;              /*!< Specifies the filter identification number (MSBs for a 32-bit
                                                   configuration, first one for a 16-bit configuration).
                                                   This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterIdLow;               /*!< Specifies the filter identification number (LSBs for a 32-bit
                                                   configuration, second one for a 16-bit configuration).
                                                   This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMskIdHigh;           /*!< Specifies the filter mask number or identification number,
                                                    according to the mode (MSBs for a 32-bit configuration,
                                                    first one for a 16-bit configuration).
                                                    This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMskIdLow;            /*!< Specifies the filter mask number or identification number,
                                                    according to the mode (LSBs for a 32-bit configuration,
                                                    second one for a 16-bit configuration).
                                                    This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterFIFOAssignment;      /*!< Specifies the FIFO (0 or 1) which will be assigned to the filter.
                                                   This parameter can be a value of @ref CAN_filter_FIFO */

    uint8_t CAN_FilterNumber;               /*!< Specifies the filter which will be initialized. It ranges from 0 to 13. */

    uint8_t CAN_FilterMode;                 /*!< Specifies the filter mode to be initialized.
                                                   This parameter can be a value of @ref CAN_filter_mode */

    uint8_t CAN_FilterScale;                /*!< Specifies the filter scale.
                                                   This parameter can be a value of @ref CAN_filter_scale */

    FunctionalState CAN_FilterActivation;   /*!< Enable or disable the filter.
                                                This parameter can be set either to ENABLE or DISABLE. */
} CAN_FilterInitType;

/**
  * @brief  CAN Tx message structure definition
  */

typedef struct
{
    uint32_t StdId;                         /*!< Specifies the standard identifier.
                                               This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId;                         /*!< Specifies the extended identifier.
                                               This parameter can be a value between 0 to 0x1FFFFFFF. */

