RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_can.h
    uint8_t IDT;                            /*!< Specifies the type of identifier for the message that
                                               will be transmitted. This parameter can be a value
                                               of @ref CAN_identifier_type */

    uint8_t RTR;                            /*!< Specifies the type of frame for the message that will
                                               be transmitted. This parameter can be a value of
                                               @ref CAN_remote_transmission_request */

    uint8_t DLC;                            /*!< Specifies the length of the frame that will be
                                               transmitted. This parameter can be a value between
                                               0 to 8 */

    uint8_t Data[8];                        /*!< Contains the data to be transmitted. It ranges from 0
                                               to 0xFF. */
} CanTxMsg;

/**
  * @brief  CAN Rx message structure definition
  */

typedef struct
{
    uint32_t StdId;                         /*!< Specifies the standard identifier.
                                               This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId;                         /*!< Specifies the extended identifier.
                                               This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDT;                            /*!< Specifies the type of identifier for the message that
                                               will be received. This parameter can be a value of
                                               @ref CAN_identifier_type */

    uint8_t RTR;                            /*!< Specifies the type of frame for the received message.
                                               This parameter can be a value of
                                               @ref CAN_remote_transmission_request */

    uint8_t DLC;                            /*!< Specifies the length of the frame that will be received.
                                               This parameter can be a value between 0 to 8 */

    uint8_t Data[8];                        /*!< Contains the data to be received. It ranges from 0 to
                                               0xFF. */

    uint8_t FID;                            /*!< Specifies the index of the filter the message stored in
                                               the mailbox passes through. This parameter can be a
                                               value between 0 to 0xFF */
} CanRxMsg;

/**
  * @}
  */

/** @defgroup CAN_Exported_Constants
  * @{
  */

/** @defgroup CAN_sleep_constants
  * @{
  */

#define CAN_InitStatus_Failed               ((uint8_t)0x00) /*!< CAN initialization failed */
#define CAN_InitStatus_Success              ((uint8_t)0x01) /*!< CAN initialization OK */

/**
  * @}
  */

/** @defgroup CAN_Mode
  * @{
  */

#define CAN_Mode_Normal                     ((uint8_t)0x00)  /*!< normal mode */
#define CAN_Mode_LoopBack                   ((uint8_t)0x01)  /*!< loopback mode */
#define CAN_Mode_Silent                     ((uint8_t)0x02)  /*!< silent mode */
#define CAN_Mode_Silent_LoopBack            ((uint8_t)0x03)  /*!< loopback combined with silent mode */

#define IS_CAN_MODE(MODE)                   (((MODE) == CAN_Mode_Normal) || \
                                             ((MODE) == CAN_Mode_LoopBack)|| \
                                             ((MODE) == CAN_Mode_Silent) || \
                                             ((MODE) == CAN_Mode_Silent_LoopBack))
/**
  * @}
  */


/**
  * @defgroup CAN_Operating_Mode
  * @{
  */
#define CAN_OperatingMode_Initialization    ((uint8_t)0x00) /*!< Initialization mode */
#define CAN_OperatingMode_Normal            ((uint8_t)0x01) /*!< Normal mode */
#define CAN_OperatingMode_Sleep             ((uint8_t)0x02) /*!< sleep mode */


#define IS_CAN_OPERATING_MODE(MODE)         (((MODE) == CAN_OperatingMode_Initialization) ||\
                                             ((MODE) == CAN_OperatingMode_Normal)|| \
                                             ((MODE) == CAN_OperatingMode_Sleep))
/**
  * @}
  */

/**
  * @defgroup CAN_Mode_Status
  * @{
  */

#define CAN_ModeStatus_Failed               ((uint8_t)0x00)                /*!< CAN entering the specific mode failed */
#define CAN_ModeStatus_Success              ((uint8_t)!CAN_ModeStatus_Failed)   /*!< CAN entering the specific mode Succeed */


/**
  * @}
  */

/** @defgroup CAN_synchronisation_jump_width
  * @{
  */

#define CAN_SJW_1tq                         ((uint8_t)0x00)  /*!< 1 time quantum */
#define CAN_SJW_2tq                         ((uint8_t)0x01)  /*!< 2 time quantum */
#define CAN_SJW_3tq                         ((uint8_t)0x02)  /*!< 3 time quantum */
#define CAN_SJW_4tq                         ((uint8_t)0x03)  /*!< 4 time quantum */

#define IS_CAN_SJW(SJW)                     (((SJW) == CAN_SJW_1tq) || ((SJW) == CAN_SJW_2tq)|| \
                                             ((SJW) == CAN_SJW_3tq) || ((SJW) == CAN_SJW_4tq))
/**
  * @}
  */

/** @defgroup CAN_time_quantum_in_bit_segment_1
  * @{
  */

#define CAN_BS1_1tq                         ((uint8_t)0x00)  /*!< 1 time quantum */
#define CAN_BS1_2tq                         ((uint8_t)0x01)  /*!< 2 time quantum */
#define CAN_BS1_3tq                         ((uint8_t)0x02)  /*!< 3 time quantum */
#define CAN_BS1_4tq                         ((uint8_t)0x03)  /*!< 4 time quantum */
#define CAN_BS1_5tq                         ((uint8_t)0x04)  /*!< 5 time quantum */
#define CAN_BS1_6tq                         ((uint8_t)0x05)  /*!< 6 time quantum */
#define CAN_BS1_7tq                         ((uint8_t)0x06)  /*!< 7 time quantum */
#define CAN_BS1_8tq                         ((uint8_t)0x07)  /*!< 8 time quantum */
#define CAN_BS1_9tq                         ((uint8_t)0x08)  /*!< 9 time quantum */
#define CAN_BS1_10tq                        ((uint8_t)0x09)  /*!< 10 time quantum */
#define CAN_BS1_11tq                        ((uint8_t)0x0A)  /*!< 11 time quantum */
#define CAN_BS1_12tq                        ((uint8_t)0x0B)  /*!< 12 time quantum */
#define CAN_BS1_13tq                        ((uint8_t)0x0C)  /*!< 13 time quantum */
#define CAN_BS1_14tq                        ((uint8_t)0x0D)  /*!< 14 time quantum */
#define CAN_BS1_15tq                        ((uint8_t)0x0E)  /*!< 15 time quantum */
#define CAN_BS1_16tq                        ((uint8_t)0x0F)  /*!< 16 time quantum */

#define IS_CAN_BS1(BS1)                     ((BS1) <= CAN_BS1_16tq)
/**
  * @}
  */

/** @defgroup CAN_time_quantum_in_bit_segment_2
  * @{
  */

#define CAN_BS2_1tq                         ((uint8_t)0x00)  /*!< 1 time quantum */
#define CAN_BS2_2tq                         ((uint8_t)0x01)  /*!< 2 time quantum */
#define CAN_BS2_3tq                         ((uint8_t)0x02)  /*!< 3 time quantum */
#define CAN_BS2_4tq                         ((uint8_t)0x03)  /*!< 4 time quantum */
#define CAN_BS2_5tq                         ((uint8_t)0x04)  /*!< 5 time quantum */
#define CAN_BS2_6tq                         ((uint8_t)0x05)  /*!< 6 time quantum */
#define CAN_BS2_7tq                         ((uint8_t)0x06)  /*!< 7 time quantum */
#define CAN_BS2_8tq                         ((uint8_t)0x07)  /*!< 8 time quantum */

